In [1]:
import numpy as np 
import pandas as pd

In [2]:
import time

In [3]:
data = {
    'Applicant_ID': [101, 102, 103, 104, 105],
    'Loan_Amount': [5000, 10000, 15000, 2000, 8000],
    'Income': [30000, 45000, 50000, 20000, 35000]
}

df = pd.DataFrame(data)
print(df)

   Applicant_ID  Loan_Amount  Income
0           101         5000   30000
1           102        10000   45000
2           103        15000   50000
3           104         2000   20000
4           105         8000   35000

In [4]:
# iterrows() -> It iterates over the rows as (index, Series) pairs

start = time.time() 
risk_scores = []

for index, row in df.iterrows():
    score = row['Loan_Amount'] / row['Income']
    risk_scores.append(score)
    
df['Risk_Score_Iterrows'] = risk_scores 
print(f"\nIterrows result: {risk_scores[:]}")

Iterrows result: [np.float64(0.16666666666666666), np.float64(0.2222222222222222), np.float64(0.3), np.float64(0.1), np.float64(0.22857142857142856)]

In [6]:
risk_scores = []

for row in df.itertuples():
    score = row.Loan_Amount / row.Income
    risk_scores.append(score)
    
df['Risk_Score_Itertuples'] = risk_scores
print(f"\nItertuples result: {risk_scores[:]}")

Itertuples result: [0.16666666666666666, 0.2222222222222222, 0.3, 0.1, 0.22857142857142856]

In [7]:
def calculate_risk(row):
    return row['Loan_Amount'] / row['Income']

df['Risk_Score_Apply'] = df.apply(calculate_risk, axis=1)
print(df)

   Applicant_ID  Loan_Amount  Income  Risk_Score_Iterrows  \
0           101         5000   30000             0.166667
1           102        10000   45000             0.222222
2           103        15000   50000             0.300000
3           104         2000   20000             0.100000
4           105         8000   35000             0.228571

   Risk_Score_Itertuples  Risk_Score_Apply
0               0.166667          0.166667
1               0.222222          0.222222
2               0.300000          0.300000
3               0.100000          0.100000
4               0.228571          0.228571

In [54]:
data = {
    'Year': [2023, 2023, 2023, 2024, 2024, 2024],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Laptop', 'Phone', 'Tablet'],
    'Sales': [500, 800, 300, 550, 850, 320],
    'Profit': [50, 100, 20, 55, 110, 25]
}

df = pd.DataFrame(data)

df_multi = df.set_index(['Year', 'Product'])
print(df_multi)

              Sales  Profit
Year Product
2023 Laptop     500      50
     Phone      800     100
     Tablet     300      20
2024 Laptop     550      55
     Phone      850     110
     Tablet     320      25

In [9]:
print(df_multi.loc[2023])

         Sales  Profit
Product
Laptop     500      50
Phone      800     100
Tablet     300      20

In [10]:
print(df_multi.loc[2023, 'Laptop'])

Sales     500
Profit     50
Name: (2023, Laptop), dtype: int64

In [16]:
# Reindexing

data = {
    'Applications': [120, 150, 170],
    'Approvals': [100, 130, 150]
}

df = pd.DataFrame(data, index=['Jan', 'Mar', 'Apr'])

print(df)
print("\n")

new_index = ['Jan', 'Feb', 'Mar', 'Apr']

df_reindexed = df.reindex(new_index)
print(df_reindexed)
print("\n")

df_filled = df.reindex(new_index, fill_value=0)
print(df_filled)
print("\n")

     Applications  Approvals
Jan           120        100
Mar           150        130
Apr           170        150


     Applications  Approvals
Jan         120.0      100.0
Feb           NaN        NaN
Mar         150.0      130.0
Apr         170.0      150.0


     Applications  Approvals
Jan           120        100
Feb             0          0
Mar           150        130
Apr           170        150

Merge() and concat()

In [17]:
# Employees
df_emp = pd.DataFrame({
    'EmpID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'DeptID': [101, 102, 101]
})

# Departments
df_dept = pd.DataFrame({
    'DeptID': [101, 102],
    'DeptName': ['HR', 'IT']
})

merge()

In [24]:
pd.merge(df_emp, df_dept, on='DeptID', how='inner')

   EmpID     Name  DeptID DeptName
0      1    Alice     101       HR
1      2      Bob     102       IT
2      3  Charlie     101       HR

In [25]:
pd.merge(df_emp, df_dept, on='DeptID', how='left')

   EmpID     Name  DeptID DeptName
0      1    Alice     101       HR
1      2      Bob     102       IT
2      3  Charlie     101       HR

In [26]:
pd.merge(df_emp, df_dept, on='DeptID', how='right')

   EmpID     Name  DeptID DeptName
0      1    Alice     101       HR
1      3  Charlie     101       HR
2      2      Bob     102       IT

In [23]:
pd.merge(df_emp, df_dept, left_on='DeptID', right_on='DeptID')

   EmpID     Name  DeptID DeptName
0      1    Alice     101       HR
1      2      Bob     102       IT
2      3  Charlie     101       HR

concat()

In [27]:
df1 = pd.DataFrame({
    'EmpID': [1, 2],
    'Name': ['Alice', 'Bob']
})

df2 = pd.DataFrame({
    'EmpID': [3, 4],
    'Name': ['Charlie', 'David']
})

In [32]:
pd.concat([df1, df2], axis=0)

   EmpID     Name
0      1    Alice
1      2      Bob
0      3  Charlie
1      4    David

In [33]:
pd.concat([df1, df2], ignore_index=True)

   EmpID     Name
0      1    Alice
1      2      Bob
2      3  Charlie
3      4    David

In [34]:
df_salary = pd.DataFrame({
    'Salary': [50000, 60000]
})

pd.concat([df1, df_salary], axis=1)

   EmpID   Name  Salary
0      1  Alice   50000
1      2    Bob   60000

In [35]:
df3 = pd.DataFrame({
    'EmpID': [5],
    'Age': [30]
})

pd.concat([df1, df3], ignore_index=True)

   EmpID   Name   Age
0      1  Alice   NaN
1      2    Bob   NaN
2      5    NaN  30.0

label-encoding and one-hot-encoding

In [43]:
df = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Green', 'Blue', 'Red']
})

print(df)

   Color
0    Red
1   Blue
2  Green
3   Blue
4    Red

In [38]:
# lable-encoding
df['color_lables'] = df['Color'].astype('category').cat.codes
print(df)

   Color  color_lables
0    Red             2
1   Blue             0
2  Green             1
3   Blue             0
4    Red             2

In [39]:
from sklearn.preprocessing import LabelEncoder 

le = LabelEncoder()

df['Color_Label'] = le.fit_transform(df['Color'])
print(df)

   Color  color_lables  Color_Label
0    Red             2            2
1   Blue             0            0
2  Green             1            1
3   Blue             0            0
4    Red             2            2

In [47]:
# One-Hot Encoding

one_hot = pd.get_dummies(df['Color']).astype(int)
print(one_hot)

   Blue  Green  Red
0     0      0    1
1     1      0    0
2     0      1    0
3     1      0    0
4     0      0    1

pivot() and melt()

In [48]:
df = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'Product': ['A', 'B', 'A', 'B'],
    'Sales': [100, 150, 120, 180]
})

print(df)

         Date Product  Sales
0  2024-01-01       A    100
1  2024-01-01       B    150
2  2024-01-02       A    120
3  2024-01-02       B    180

In [49]:
pivot_df = df.pivot(
    index='Date',
    columns='Product',
    values='Sales'
)

print(pivot_df)

Product       A    B
Date
2024-01-01  100  150
2024-01-02  120  180

Pivot() will fail if duplicates exists for index, columns.
So we can use pivot_table()

In [51]:
pivot_table_df = pd.pivot_table(
    df,
    index='Date',
    columns='Product',
    values='Sales',
    aggfunc='sum'
)

print(pivot_table_df)

Product       A    B
Date
2024-01-01  100  150
2024-01-02  120  180

In [53]:
# melt()

df1 = pivot_table_df.reset_index()

melt_df = pd.melt(
    df1,
    id_vars='Date',
    value_vars=['A', 'B'],
    var_name='Product',
    value_name='Sales'
)

print(melt_df)

         Date Product  Sales
0  2024-01-01       A    100
1  2024-01-02       A    120
2  2024-01-01       B    150
3  2024-01-02       B    180